import "../App.css";

export default function Temple() {
  return (
    <div>
      {/* Hero Section */}
  <section className="hero-section">
    <div className="hero-overlay"></div>

    <div className="hero-content">
      <p className="hero-subtitle">Shri</p>
      <h1 className="hero-title">Mahakaleshwar</h1>
      <p className="hero-location">Mandir, Ujjain</p>

      <div className="hero-divider"></div>
      <p className="hero-tagline">DARSHAN BOOKING</p>
    </div>
  </section>

    <div className="temple-section">
      <h2>Temple Information</h2>
      <p>
        <b>Shree Mahakaleshwar Jyotirlinga</b> मंदिर, उज्जैन (मध्य प्रदेश) में स्थित है
        और यह 12 ज्योतिर्लिंगों में से एक है। यह मंदिर भगवान शिव को समर्पित है
        और इसे सबसे महत्वपूर्ण शिवालयों में गिना जाता है। 
      </p>
      
      <p>
        महाकालेश्वर ज्योतिर्लिंग की विशेषता यह है कि यहाँ का शिवलिंग
        <b> स्वयंभू (Self-Manifested)</b> है, यानी इसे किसी ने स्थापित नहीं किया,
        बल्कि यह स्वयं पृथ्वी से प्रकट हुआ है। यही कारण है कि यह भक्तों के बीच
        अत्यधिक पूजनीय और शक्तिशाली माना जाता है। 
      </p>

      <h3>महत्वपूर्ण विशेषताएँ</h3>
      <ul>
        <li><b>भस्म आरती:</b> हर सुबह सूर्योदय से पहले की जाती है, जिसमें 
        शिवलिंग को ताज़ी चिता की भस्म से सजाया जाता है।</li>
        <li><b>शक्ति का स्रोत:</b> यह ज्योतिर्लिंग अंदर से शक्ति प्राप्त करता है, 
        जबकि अन्य ज्योतिर्लिंग मंत्रों और विधियों से प्रतिष्ठित किए जाते हैं।</li>
        <li><b>नदी किनारा:</b> मंदिर पवित्र <b>क्षिप्रा नदी</b> के किनारे स्थित है।</li>
        <li><b>वास्तुकला:</b> यहाँ की वास्तुकला में मराठा, भुमिजा और चालुक्य 
        शैलियों का सुंदर संगम देखने को मिलता है।</li>
      </ul>

      <h3>धार्मिक महत्व</h3>
      <p>
        महाकालेश्वर मंदिर का उल्लेख प्राचीन ग्रंथों जैसे 
        <i> शिव पुराण</i>, <i> स्कंद पुराण</i>, और <i> कालिदास के रघुवंश</i> में मिलता है। 
        ऐसा कहा जाता है कि यहाँ दर्शन करने से मनुष्य को मोक्ष की प्राप्ति होती है और सभी 
        पापों का नाश होता है।
      </p>

      <h3>दर्शन और आरती के समय</h3>
      <ul>
        <li><b>सुबह आरती:</b> 4:00 AM (भस्म आरती)</li>
        <li><b>मध्याह्न पूजन:</b> 12:00 PM</li>
        <li><b>शाम की आरती:</b> 7:00 PM</li>
        <li><b>शयन आरती:</b> 10:30 PM</li>
      </ul>

      <h3>कैसे पहुँचें?</h3>
      <p>
        उज्जैन शहर सड़क, रेल और हवाई मार्ग से देशभर से जुड़ा हुआ है। 
        <b>इंदौर एयरपोर्ट</b> सबसे नज़दीकी हवाई अड्डा है जो लगभग 55 किलोमीटर दूर है। 
        उज्जैन जंक्शन रेलवे स्टेशन से मंदिर की दूरी लगभग 2 किलोमीटर है। 
      </p>
    </div>
    </div>
  );
}
